let lookback = 30d;
let basetable = DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(lookback)
| where ConfigurationId in (
    'scid-91','scid-2000','scid-2001','scid-2002','scid-2003',
    'scid-2010','scid-2011','scid-2012','scid-2014','scid-2016'
)
| extend Test = case(
    ConfigurationId == 'scid-2000', 'SensorEnabled',
    ConfigurationId == 'scid-2001', 'SensorDataCollection',
    ConfigurationId == 'scid-2002', 'ImpairedCommunications',
    ConfigurationId == 'scid-2003', 'TamperProtection',
    ConfigurationId == 'scid-2010', 'AntivirusEnabled',
    ConfigurationId == 'scid-2011', 'AntivirusSignatureVersion',
    ConfigurationId == 'scid-2012', 'RealtimeProtection',
    ConfigurationId == 'scid-91',   'BehaviorMonitoring',
    ConfigurationId == 'scid-2014', 'AntivirusReporting',
    ConfigurationId == 'scid-2016', 'CloudProtection',
    'N/A'
),
Result = case(
    IsApplicable == 0, 'N/A',
    IsCompliant  == 1, 'GOOD',
    'BAD'
)
| extend packed = pack(Test, Result)
| summarize Tests = make_bag(packed), DeviceName = any(DeviceName) by DeviceId
| evaluate bag_unpack(Tests);
let avmodetable = DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(lookback)
| where ConfigurationId == 'scid-2010' and isnotnull(Context)
| extend avdata = parse_json(Context)
| extend AVMode = case(
    tostring(avdata[0][0]) == '0', 'Active',
    tostring(avdata[0][0]) == '1', 'Passive',
    tostring(avdata[0][0]) == '4', 'EDR Blocked',
    'Unknown'
)
| project DeviceId, AVMode;
let avsigtable = DeviceTvmSecureConfigurationAssessment
| where Timestamp > ago(lookback)
| where ConfigurationId == 'scid-2011' and isnotnull(Context)
| extend avdata = parse_json(Context)
| extend
    AVSigVersion         = tostring(avdata[0][0]),
    AVEngineVersion      = tostring(avdata[0][1]),
    AVSigLastUpdateTime  = tostring(avdata[0][2]),
    AVProductVersion     = tostring(avdata[0][3])
| extend IsMDEVersionCompliant = iff(IsCompliant == '1', 'YES', 'NO')
| project DeviceId, OSPlatform,
    AVSigVersion, AVEngineVersion,
    AVSigLastUpdateTime, AVProductVersion, IsMDEVersionCompliant;
let merged = basetable
| join kind=leftouter avsigtable on DeviceId
| join kind=leftouter avmodetable on DeviceId
| where OSPlatform !in ('iOS', 'macOS');
let compliance = merged
| extend ComplianceArray = pack_array(
    pack_array('SensorEnabled',            iff(isnull(SensorEnabled)            or SensorEnabled            == '', 'N/A', SensorEnabled)),
    pack_array('SensorDataCollection',     iff(isnull(SensorDataCollection)     or SensorDataCollection     == '', 'N/A', SensorDataCollection)),
    pack_array('ImpairedCommunications',   iff(isnull(ImpairedCommunications)   or ImpairedCommunications   == '', 'N/A', ImpairedCommunications)),
    pack_array('TamperProtection',         iff(isnull(TamperProtection)         or TamperProtection         == '', 'N/A', TamperProtection)),
    pack_array('AntivirusEnabled',         iff(isnull(AntivirusEnabled)         or AntivirusEnabled         == '', 'N/A', AntivirusEnabled)),
    pack_array('AntivirusSignatureVersion',iff(isnull(AntivirusSignatureVersion) or AntivirusSignatureVersion== '', 'N/A', AntivirusSignatureVersion)),
    pack_array('RealtimeProtection',       iff(isnull(RealtimeProtection)       or RealtimeProtection       == '', 'N/A', RealtimeProtection)),
    pack_array('BehaviorMonitoring',       iff(isnull(BehaviorMonitoring)       or BehaviorMonitoring       == '', 'N/A', BehaviorMonitoring)),
    pack_array('AntivirusReporting',       iff(isnull(AntivirusReporting)       or AntivirusReporting       == '', 'N/A', AntivirusReporting)),
    pack_array('CloudProtection',          iff(isnull(CloudProtection)          or CloudProtection          == '', 'N/A', CloudProtection))
)
| mv-expand ComplianceArray
| extend TestResult = tostring(ComplianceArray[1])
| summarize
    BadCount  = countif(TestResult == 'BAD'),
    GoodCount = countif(TestResult == 'GOOD')
    by DeviceId
| extend OverallCompliance = iif(GoodCount == 10 and BadCount == 0, 'YES', 'NO');
merged
| join kind=leftouter compliance on DeviceId
| project-away DeviceId1, DeviceId2, DeviceId3
